ci4/app/Controllers/Artikel.php

SELECT COUNT(*) AS `numrows`
FROM `artikel`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
ORDER BY `artikel`.`id` DESC
 LIMIT 10
---
public function admin_index()
{
    $title = 'Daftar Artikel (Admin)';
    $model = new ArtikelModel();
    $kategoriModel = new KategoriModel();

    $q = $this->request->getVar('q') ?? '';
    $kategori_id = $this->request->getVar('kategori_id') ?? '';
    $page = $this->request->getVar('page') ?? 1;

    // TUGAS 4: Ambil parameter sorting (default: urut berdasarkan ID desc)
    $sortBy = $this->request->getVar('sort_by') ?? 'artikel.id';
    $sortOrder = $this->request->getVar('sort_order') ?? 'desc';

    $builder = $model->table('artikel');
    $builder->select('artikel.*, kategori.nama_kategori');
    $builder->join('kategori', 'kategori.id_kategori = artikel.id_kategori', 'left');

    if ($q != '') {
        $builder->like('artikel.judul', $q);
    }

    if ($kategori_id != '') {
        $builder->where('artikel.id_kategori', $kategori_id);
    }

    // TUGAS 4: Terapkan fungsi orderBy pada query builder
    $builder->orderBy($sortBy, $sortOrder);

    $artikel = $builder->paginate(10, 'default', $page);

SELECT *
FROM `kategori`
---
    if ($this->request->isAJAX()) {
        return $this->response->setJSON($data);
    } else {
        $data['kategori'] = $kategoriModel->findAll();

SELECT *
FROM `kategori`
---
        $kategoriModel = new KategoriModel();
        $data = [
            'title'    => 'Tambah Artikel',
            'kategori' => $kategoriModel->findAll()