ci4/app/Controllers/Post.php

    public function create()
    {
        $model = new ArtikelModel();
        $data = [
            'judul' => $this->request->getVar('judul'),
            'isi'   => $this->request->getVar('isi')
        ];

        $model->insert($data);
---
INSERT INTO `artikel` (`judul`, `isi`) VALUES ('Uji Coba Judul', 'Uji coba isi konten artikel baru')

    public function delete($id = null)
    {
        $model = new ArtikelModel();
        $cekData = $model->where('id', $id)->first();

        if ($cekData) {
            $model->delete($id);
---
SELECT *
FROM `artikel`
WHERE `id` = '8'
 LIMIT 1
DELETE FROM `artikel`
WHERE `id` IN ('8')